Revit API Introduction Labs
LabUtils.ElementDescription Method (, Boolean)
 Return a description string including element id for a given element.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public static string ElementDescription(
	Element e,
	bool includeId
)
Visual Basic (Declaration)
Public Shared Function ElementDescription ( _
	e As Element, _
	includeId As Boolean _
) As String
Visual C++
public:
static String^ ElementDescription(
	Element^ e,
	bool includeId
)
Parameters
e
Type: Element
includeId
Type: System.Boolean
See Also
LabUtils Class
ElementDescription Overload
Labs Namespace